backend/app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "phone", "email", "website", "address", "additional_info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @company = Company.new(company_params)
    @company.contacts = relationship_params([:contacts]) || []

    if @company.save