backend/app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    @contact.company = relationship_params([:company])
    @contact.offers = relationship_params([:offers]) || []
    @contact.projects = relationship_params([:projects]) || []

    if @contact.save
---
INSERT INTO "contacts" ("family_name", "given_names", "company_id", "title", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @contact.update(contact_params)
---
UPDATE "contacts" SET "company_id" = ?, "title" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["company_id", 2], ["title", "CMO"], ["updated_at", 2016-03-31 17:08:05 UTC], ["id", 1]]