backend/app/controllers/notes_controller.rb

  def create
    note_klass = params[:data][:type].underscore.classify.safe_constantize
    @note = note_klass.new(note_params)
    @note.topic = relationship_params[:topic]
    @note.contact = relationship_params[:contact].first

    if @note.save
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notes" ("type", "title", "description", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["type", "PhoneCall"], ["title", "Lorem Title"], ["description", "Lorem Ipsum"], ["contact_id", 1], ["created_at", 2016-04-01 17:34:04 UTC], ["updated_at", 2016-04-01 17:34:04 UTC]]