backend/app/controllers/projects_controller.rb

INSERT INTO "contacts_projects" ("contact_id", "project_id") VALUES (?, ?)  [["contact_id", 1], ["project_id", 6]]
INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Awesome Project"], ["created_at", 2016-03-31 17:25:59 UTC], ["updated_at", 2016-03-31 17:25:59 UTC]]
---
  def create
    @project = Project.new(project_params)
    @project.contacts = (relationship_params[:contacts] || [])
    @project.offers = (relationship_params[:offers] || [])
    @project.tasks = (relationship_params[:tasks] || [])

    if @project.save